---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FamilyAlwaysVertical
source: html/6f2c8627-4733-119a-aaff-760e7e413df5.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FamilyAlwaysVertical Property

"Always vertical"

## Syntax (C#)
```csharp
public static ForgeTypeId FamilyAlwaysVertical { get; }
```